{
  "format": "graph-model",
  "generatedBy": "2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.15.0",
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "28"
            },
            {
              "size": "28"
            },
            {
              "size": "1"
            }
          ]
        }
      }
    },
    "outputs": {
      "dense": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "10"
            }
          ]
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/flatten/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1600"
                  },
                  {
                    "size": "10"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "10"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "input_1",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "28"
                },
                {
                  "size": "28"
                },
                {
                  "size": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/Relu",
        "op": "_FusedConv2D",
        "input": [
          "input_1",
          "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": {
            "f": 0.0
          },
          "num_args": {
            "i": "1"
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "explicit_paddings": {
            "list": {}
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential/conv2d/Relu"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "explicit_paddings": {
            "list": {}
          },
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "padding": {
            "s": "VkFMSUQ="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
          "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "explicit_paddings": {
            "list": {}
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "epsilon": {
            "f": 0.0
          },
          "num_args": {
            "i": "1"
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential/conv2d_1/Relu"
        ],
        "attr": {
          "explicit_paddings": {
            "list": {}
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/flatten/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
          "StatefulPartitionedCall/sequential/flatten/Const"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "Tshape": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/flatten/Reshape",
          "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": {
            "b": false
          },
          "num_args": {
            "i": "1"
          },
          "transpose_a": {
            "b": false
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA=="
              ]
            }
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "epsilon": {
            "f": 0.0
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/Softmax",
        "op": "Softmax",
        "input": [
          "StatefulPartitionedCall/sequential/dense/BiasAdd"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": [
          "StatefulPartitionedCall/sequential/dense/Softmax"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      }
    ],
    "library": {},
    "versions": {
      "producer": 987
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/flatten/Const",
          "shape": [
            2
          ],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "shape": [
            1600,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}